s='helloword'
print('{0:*<20}'.format(s))#字符串显示宽度为20，不够用*填充，左对齐
print('{0:*>20}'.format(s))#字符串显示宽度为20，不够用*填充，右对齐
print('{0:*^20}'.format(s))#字符串显示宽度为20，不够用*填充，居中对齐

#居中对齐的另一种方式
print(s.center(20,'*'))

#千位分隔符（只适用于整数和浮点数）
print('{0:,}'.format(987654321))
print('{0:,}'.format(987654322.213333))

#浮点数小数部分的精度控制
print('{0:.2f}'.format(3.1412))
print('{0:.2f}'.format(3.1452))

#如果是字符串类型，点 后面表示最大的显示长度
print('{0:.5}'.format(s))

#整数类型
a=425
print('二进制：{0:b}，十进制：{0:d}，八进制：{0:x}，十六进制：{0:X}'.format(a))

#浮点类型
b=3.1415926
print('{0:.3f}，{0:.2e}，{0:.2E}，{0:.2%}'.format(b))
print('{0:.3f}，{0:.3e}，{0:.3E}，{0:.3%}'.format(b))